---
kind: method
id: M:Autodesk.Revit.DB.ElementIdSetFilter.GetIdsToInclude
source: html/cadf037a-cfb1-354c-9d7a-701edeb70a6d.htm
---
# Autodesk.Revit.DB.ElementIdSetFilter.GetIdsToInclude Method

Returns the ids of this filter.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetIdsToInclude()
```

## Returns
The collection of ids.